comparison/client/original/resolve.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
    xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof"
    xmlns:pnpx="http://schemas.microsoft.com/windows/pnpx/2005/10"
    xmlns:pub="http://schemas.microsoft.com/windows/pub/2005/07"
>
    <soap:Header>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Resolve</wsa:Action>
        <wsa:MessageID>urn:uuid:ba866dfd-8135-11f0-accb-d45ddf1e11a9</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Resolve>
            <wsa:EndpointReference>
                <wsa:Address>urn:uuid:ca6b4c38-7270-45fc-b4aa-f9b0874c138e</wsa:Address>
            </wsa:EndpointReference>
        </wsd:Resolve>
    </soap:Body>
</soap:Envelope>
